# TrussUserDefinedMemberNotJoined Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..TrussFailures..::..TrussUserDefinedMemberNotJoined Property
BuiltInFailures..::..TrussFailures Class See Also
---
Both start and end of web must intersect the truss.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TrussUserDefinedMemberNotJoined { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TrussUserDefinedMemberNotJoined As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TrussUserDefinedMemberNotJoined {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..TrussFailures Class
Autodesk.Revit.DB Namespace